package javaCore.basic;

/**
 * Комментарии в Java, как и в большинстве других языков программирования, игнорируются
 * при выполнении программы. Таким образом, в программу можно добавить
 * столько комментариев, сколько потребуется, не опасаясь увеличить ее объем. В Java предоставляются
 * три способа выделения комментариев в тексте.
 *
 * @author Ross Khapilov
 * @version 1.0 25.09.2018
 */
public class Commentary {
    /**
     * Первый вариант комментариев
     *
     * @param args
     */
    public static void main(String[] args) {
        //Второй вариант

        /*
        Третий Вариант комментариев
         */
    }
}
